Рабочая.Задачи2/src/Catalogs/ЦБР_Задача/ЦБР_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_Задача</name>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ВидЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЧасыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратитьВнимание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредСогласованныеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительЗадачи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стартовала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзялиВРаботу</name>
    <comment>Истина = Руководитель проверил и взял задачу в работу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипЗадачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команда</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.ЦБР_РольВЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.ЦБР_Конфигурации1С</types>
        <types>CatalogRef.cbr_Конфигурации1С</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Релиз</name>
      <type>
        <types>EnumRef._центрСостояниеРелизовКонфигураций</types>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеКонфигурации</name>
      <type>
        <types>EnumRef._центрСостоянияКонфигурацийКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьРасширения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проблемная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонфигурацияКлиентаОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>Приложение</name>
      <type>
        <types>CatalogRef.ЦБР_ЗадачаПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/Enums/ЦБР_ТипЗадачи/ЦБР_ТипЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ТипЗадачи</name>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
  <enumValues>
    <name>Демо</name>
  </enumValues>
  <enumValues>
    <name>ДляКомпании</name>
  </enumValues>
  <enumValues>
    <name>Аутсорс</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_Задача/ManagerModule.bsl
#Область ОбработчикиСобытий

#Область ОбработчикиФормы

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Стандартная Тогда
		Представление = СтрШаблон("%1; %2", Данные.Заказчик, Данные.Наименование);
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.ДляКомпании Тогда
		Представление = СтрШаблон("%1: %2", "Для компании", Данные.Наименование); 
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Демо Тогда
		Представление = СтрШаблон("%1: %2; %3", "ДЕМО", Данные.Заказчик, Данные.Наименование); 
	ИначеЕсли Данные.ТипЗадачи = Перечисления.ЦБР_ТипЗадачи.Аутсорс Тогда
		Представление = СтрШаблон("%1: %2; %3", "АУТСОРС", Данные.Заказчик, Данные.Наименование); 
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры //ОбработкаПолученияПредставления

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Заказчик");
	Поля.Добавить("ТипЗадачи");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры //ОбработкаПолученияПолейПредставления

#КонецОбласти

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеФункцииИПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
КонецПроцедуры //ДобавитьКомандыПечати

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры //Печать

#КонецОбласти

#КонецЕсли
